# GetLoadRequestId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadData..::..GetLoadRequestId Method
ExternalResourceLoadData Class See Also
---
Returns the load operation GUID.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid GetLoadRequestId()
```

Visual Basic
---
```text
Public Function GetLoadRequestId As Guid
```

Visual C++
---
```text
public:
Guid GetLoadRequestId()
```

# ### Return Value
The load operation GUID.
# Remarks
This Id uniquely identifies the load request. IExternalResourceServers can use it as a key to store and retrieve information (such as errors) that is relevant to a specific load operation.
# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace